package task_19_Lists;

import java.util.Arrays;

public class Flag {

//Напишете програма, която отпечатва фигурата по-долу на екрана:
//██████████
//██████████
//██████████
//Създайте масив, който да запълните със символа ‘\u2588’, използвайки метода Array.fill().
//Ако ви е интересно, можете да добавите цвят преди всеки ред като отпечатате стринга “\033[ЦВЯТm”,
// като за цвят имате следните числа:
//39 = бял
//32 = червен
//31 = зелен
//! ВНИМАНИЕ ! - не пускайте решение с цвят, защото системата ще го приеме за грешно. Направете цвета,
// само ако сте любопитни и само на вашия компютър.

    public static void main(String[] args) {

        Character[] flag =new Character[10];

        Arrays.fill(flag, '\u2588');
        for (int i = 0; i < 3; i++) {

            for (int j = 0; j < flag.length; j++) {

                System.out.print(flag[i]);
            }
            System.out.println();
        }

    }
}
